from modules.search_algorithms import bfs, dfs
from modules.graph_operations import create_graph

def task2():
    """
    Завдання 2: Пошук шляхів між вершинами за допомогою BFS та DFS.
    Використовує алгоритми BFS та DFS для знаходження шляхів між вершинами в графі.
    """
    print("Пошук шляхів між вершинами за допомогою BFS та DFS...")
    G = create_graph()

    # Пояснення до BFS
    print("\nАлгоритм BFS (Breadth-First Search) знаходить шлях, проходячи через усі суміжні вершини по черзі, починаючи з початкової.")
    print("Цей алгоритм гарантує, що він знайде найкоротший шлях за кількістю ребер у незважених графах.")
    print("Результат пошуку шляху між вершинами за допомогою BFS:")

    bfs_path = bfs(G, 1, 4)
    print(f"Шлях, знайдений BFS: {bfs_path}")
    
    print("\nАлгоритм DFS (Depth-First Search) працює, досліджуючи глибину кожної вершини перед тим, як перейти до наступної.")
    print("Цей алгоритм може знайти шлях, але не гарантує найкоротший шлях у графі.")
    print("Результат пошуку шляху між вершинами за допомогою DFS:")
    dfs_path = dfs(G, 1, 4)
    print(f"Шлях, знайдений DFS: {dfs_path}")
